app/controllers/issued_items_controller.rb

SELECT "issued_items".* FROM "issued_items"
---
  def index
    @issued_items = IssuedItem.all

INSERT INTO "issued_items" ("Name", "RollNo", "Email", "Equipment", "IssueDate", "ReturnDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @issued_item = IssuedItem.new(issued_item_params)

    respond_to do |format|
      if @issued_item.save

DELETE FROM "issued_items" WHERE "issued_items"."id" = ?  [["id", 1]]
---
  def destroy
    @issued_item.destroy

SELECT  "issued_items".* FROM "issued_items" WHERE "issued_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_issued_item
      @issued_item = IssuedItem.find(params[:id])